[
  {
    "category": "SP18",
    "title": "Usman Ologunebi",
    "text": "I am from Bloomfield, New Jersey and of Nigerian descent. I currently serve as the Keeper of Records. I am currently a junior at Lehigh University studying bioengineering: biomaterials and biomechanics track. I hope to work in regenerative medicine and making prosthetics. I am very involved in the National Society of Black Engineers (NSBE), Black Student Union (BSU), Men of Color Alliance (MOCA), and University Productions. In my free time, I enjoy playing video games and soccer.",
    "image": "https://i.imgur.com/3TLRv37.png"
  },
  {
    "category": "SP18",
    "title": "Max Louissaint",
    "text": "I was born in Haiti but moved to Philadelphia around the age of 11 years old. I speak Haitian Creole, French, and English. At Lehigh University, I am a Mechanical Engineering major and a Computer Science minor. My primary interests are automotive and robotics. I am a member of the National Society of Black Engineers (NSBE), Formula SAE, African Caribbean Cultural Club, and Men of Color Alliance (MOCA). During my free time, I like to listen to music, watch movies, play soccer, or play basketball.",
    "image": "https://i.imgur.com/fv22qG5.jpg"
  },
  {
    "category": "SP17",
    "title": "Julius Verdio Wibisono",
    "text": "Currently, I am an Undergraduate Student studying Finance & Management at Lehigh University. Throughout my college years and other than chapter involvement, I have been heavily involved with the Office of Multicultural Affairs, Men of Color Alliance, and the Cultural Greek Council. I am from Semarang, Indonesia and migrated to the United States when I was seven years old. After I graduate, I am seeking to be a financial consultant for a firm. My current interests include Creative Cloud for Adobe, Fashion, and Investing.",
    "image": "https://i.imgur.com/ChRaqk8.jpg"
  },
  {
    "category": "SP17",
    "title": "Donterrius Walker",
    "text": "I am a senior from Lehigh University. I am majoring in Africana Studies, with a concentration in Hip-hop, and three minors: Documentary storytelling, Marketing, & Music industry. On Campus, I am currently the Secretary for Lehigh’s Black Student Union & Lehigh’s Cultural Greek Council and the President of Lehigh’s Men of Color Alliance organization. I am also the recipient of 2 Williams Prize Awards (DJ/Sound Board Op, Act Like You Know: 10-year Anniversary Show [Theatre - 2018] & Performance/Acting, Act Like You Know: 10-year Anniversary Show (Theatre - 2018).",
    "image": "https://i.imgur.com/idB8ufF.jpg"
  }
]
